---
title: CurveArrArray
classe: Autodesk.Revit.DB.CurveArrArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# CurveArrArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `curveArrArray.IsEmpty` | Boolean |
| `CurveArray Item { get; set; }` | `curveArrArray.Item` | CurveArray |
| `Int32 Size { get; }` | `curveArrArray.Size` | Int32 |
| `Void Append(CurveArray)` | `curveArrArray.Append(item)` | Void |
| `Void Clear()` | `curveArrArray.Clear()` | Void |
| `CurveArrArrayIterator ForwardIterator()` | `curveArrArray.ForwardIterator()` | CurveArrArrayIterator |
| `IEnumerator GetEnumerator()` | `curveArrArray.GetEnumerator()` | IEnumerator |
| `Void Insert(CurveArray, Int32)` | `curveArrArray.Insert(item, index)` | Void |
| `CurveArrArrayIterator ReverseIterator()` | `curveArrArray.ReverseIterator()` | CurveArrArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```